;********************************************************************
;       Ex10-1.asm
;       調整數位類比轉換電壓值，並將比例結果呈現在PORTD發光二極體
;********************************************************************
			list p=18f45k22		
#include 	<p18f45k22.inc>			; 納入定義檔Include file located at defult directory
;
C_Hold_Delay	equ		0x20			; 延遲時間計數暫存器
;					       		
;********************************************************************
;****	RESET Vector @ 0x0000
;********************************************************************

			org		0x00 		; 程式起始位址
 			bra		Main
;
;********************************************************************
;****	The Main Program start from Here !! 
;********************************************************************

			org		0x02A		; 主程式起始位址
Main:
			call	Init_IO			; 呼叫數位輸出入埠初始化函式
			call	Init_DAC		; 呼叫數位類比訊號轉換模組初始化函式
;
DAC_Loop		call	C_Hold_Time		; 延遲50uS完成類比訊號採樣保持
			dcfsnz	PORTD			; 檢查是否為零，是則重設為0.5(V+ - V-)
			bsf	PORTD, 4
			movff	PORTD, VREFCON2			; 是，將結果轉移到PORTD
;
			goto	DAC_Loop		 ; 重複無窮迴圈
;***********************************************************************
;****		Initial the PORTD for the output port 
;***********************************************************************
Init_IO:						; 數位輸出入埠初始化函式
			banksel ANSELD
			clrf	ANSELD, BANKED	; 將PORTD類比功能解除，設定數位輸入腳位
			bcf	ANSELA, 4, BANKED ;; 將RA4類比功能解除，設定數位輸入腳位
						; 將PORTA, RA4腳位設定為訊號輸入
			
			clrf	PORTD		; 清除PORTD暫存器數值
			bsf	PORTD, 4	; 設為0.5(V+ - V-)
			clrf	TRISD		; 設定PORTD全部為數位輸出
;
			return
;***********************************************************************
;****		Initial DA converter
;***********************************************************************
Init_DAC:
  			movlw	b'11000000'		; 開啟模組/內部電壓/低電壓使用正端/電源選用VDD/VSS，
;			movlw	b'11100000'	   ;將RA2設為DACOUT, DSW1-3需斷開成OFF
  			movwf	VREFCON1	; 啟動DAC模組
;
			movlw	b'00010000'		; 設定輸出為0.5*(VDD-VSS)
			movwf	VREFCON2			
;
			return
;
;***********************************************************************
; 採樣保持時間延遲函式	 (50uS) 
;***********************************************************************
C_Hold_Time:
   			movlw	.125
   			movwf	C_Hold_Delay
   			nop
   			decfsz	C_Hold_Delay,F
   			bra		$-4
   			return

;**************************************************************************
; 高優先權中斷執行函式
;************************************************************************** 
Hi_ISRs
			retfie	FAST				 ; Return with shadow register
; 
	 	  	END
